
#Считать с клавиатуры полный адрес англоязычной html страницы.
#С использованием urlparse получить из адреса кортеж значений.
#Вывести текст всех заголовков уровня h1 одной строкой через пробел без дополнительных символов вначале и конце строки.
#Примечание. Если внутри тегов h1 содержатся ссылки, то нужно выводить вместе со ссылками.

#Пример входных данных:
#http://en.ifmo.ru/en/contacts/Contacts.htm

#Пример выходных данных:
#('http', 'en.ifmo.ru', '/en/contacts/Contacts.htm', '', '', '')
#Contacts






